#+title: Introducing DataCamp Workspace with R
#+startup: overview hideblocks indent inlineimages
#+property: header-args:R :results output :noweb yes :session *R*
#+options: toc:nil num:1 ^:nil
** Importing a CSV file as data frame

We import the CSV file as a data frame and print the column headers
(alongside other information) with the ~str~ function. If you only want
the headers as a vector, use ~colnames~ instead:

#+begin_src R
  df = read.csv('../data/unicorn_companies.csv')
  str(df)
  colnames(df)
#+end_src

#+RESULTS:
: 'data.frame':	917 obs. of  6 variables:
:  $ Company         : chr  "Bytedance" "SpaceX" "Stripe" "Klarna" ...
:  $ Valuation...B.  : chr  "$140.00" "$100.30" "$95.00" "$45.60" ...
:  $ Date.Added      : chr  "4/7/17" "12/1/12" "1/23/14" "12/12/11" ...
:  $ Country         : chr  "China" "United States" "United States" "Sweden" ...
:  $ Category        : chr  "Artificial intelligence" "Other" "Fintech" "Fintech" ...
:  $ Select.Investors: chr  "Sequoia Capital China, SIG Asia Investments, Sina Weibo, Softbank Group" "Founders Fund, Draper Fisher Jurvetson, Rothenberg Ventures" "Khosla Ventures, LowercaseCapital, capitalG" "Institutional Venture Partners, Sequoia Capital, General Atlantic" ...
: [1] "Company"          "Valuation...B."   "Date.Added"      
: [4] "Country"          "Category"         "Select.Investors"

You can also print the data frame directly. When you run this cell,
either with the mouse or by entering CTRL-ENTER, the first 10 records
of the DataFrame ~df~ and the headline with the features are shown. At
the bottom of the output you see an option to create a ~Chart~ - better
wait with that until you understand the data set better.

#+begin_src R :results none
  df
#+end_src

Though the data look quite clean and appealing, a table view is not
the best way to get an overview - there are too many records.

** Viewing ~unique~ column data

For investment purposes, the ~Category~ column or feature is most
interesting: this is the type of company. How many of these types
are there?

To print out all unique categories, we can use the ~unique~
function, which will return all unique entries in the ~Category~
column if we index the data frame accordingly.
#+begin_src R
  unique(df$Category) # df['Category'] or df[,5] also work
#+end_src

#+RESULTS:
#+begin_example
 [1] "Artificial intelligence"            
 [2] "Other"                              
 [3] "Fintech"                            
 [4] "Internet software & services"       
 [5] "Supply chain, logistics, & delivery"
 [6] "Data management & analytics"        
 [7] "Edtech"                             
 [8] "E-commerce & direct-to-consumer"    
 [9] "Hardware"                           
[10] "Auto & transportation"              
[11] "Health"                             
[12] "Consumer & retail"                  
[13] "Finttech"                           
[14] "Travel"                             
[15] "Cybersecurity"                      
[16] "Mobile & telecommunications"        
[17] "Artificial Intelligence"
#+end_example

You can see that there are duplicates because of typos
(~Finttech~) and capitalization (~Artificial Intelligence~). Let's
remove the ambiguities.

To get help, you can use ~?~ or the ~help~ function:
#+begin_example python
  ?unique
  help(unique)
#+end_example

There is a lot of help information here and you may want to look at it
on the web instead e.g. using [[https://stat.ethz.ch/R-manual/R-devel/library/base/html/00Index.html][this function index for base R]].

** Clean data frame column ~Category~

There are a couple of typos in the ~Category~ values: 'Artificial
intelligence' needs to become 'Artificial Intelligence', and
'Finttech' needs to become 'Fintech' everywhere in the dataframe.

You can do this with ~gsub~, which matches the first argument
and replaces it by the second everywhere in the column:
#+begin_src R
  ## Correct typos in the 'Category' column
  df$Category <- gsub("Artificial intelligence", "Artificial Intelligence", df$Category)
  df$Category <- gsub("Finttech", "Fintech", df$Category)

  ## Display the first few rows to verify the changes
  unique(df$Category)
#+end_src

#+RESULTS:
#+begin_example
 [1] "Artificial Intelligence"            
 [2] "Other"                              
 [3] "Fintech"                            
 [4] "Internet software & services"       
 [5] "Supply chain, logistics, & delivery"
 [6] "Data management & analytics"        
 [7] "Edtech"                             
 [8] "E-commerce & direct-to-consumer"    
 [9] "Hardware"                           
[10] "Auto & transportation"              
[11] "Health"                             
[12] "Consumer & retail"                  
[13] "Travel"                             
[14] "Cybersecurity"                      
[15] "Mobile & telecommunications"
#+end_example

*** Grouping data by column with base R

With base R, we can use the ~stats::aggregate~ function, which splits
the data into subsets.
#+begin_src R
  ## Group by 'Category' and get the count in each category
  grouped_df <- aggregate(Company ~ Category, data=df1, FUN=length)
  colnames(grouped_df)[2] <- "Count"

  ## Display the grouped data
  grouped_df
#+end_src

#+RESULTS:
: Error in eval(m$data, parent.frame()) : object 'df1' not found
: Error in colnames(grouped_df)[2] <- "Count" : 
:   object 'grouped_df' not found
: Error: object 'grouped_df' not found

The function ~order~ returns a permutation that rearranges
its first argument into ascending (default) or descending order:
#+begin_src R
  ## Sort grouped_df by 'Count' in ascending order:
  grouped_df <- grouped_df[order(grouped_df$Count),]
  grouped_df
#+end_src

#+RESULTS:
: Error: object 'grouped_df' not found
: Error: object 'grouped_df' not found

